tinko26/ao/src/ao_sys_xc32_pic32/ao_can_2.h
#ifndef AO_CAN_FILTER_EID_2_11

#define AO_CAN_FILTER_EID_2_11          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_11

#define AO_CAN_FILTER_ENABLE_2_11       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_11

#define AO_CAN_FILTER_FIFO_2_11         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_11

#define AO_CAN_FILTER_IDE_2_11          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_11

#define AO_CAN_FILTER_MASK_2_11         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_11

#define AO_CAN_FILTER_SID_2_11          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_12

#define AO_CAN_FILTER_EID_2_12          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_12

#define AO_CAN_FILTER_ENABLE_2_12       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_12

#define AO_CAN_FILTER_FIFO_2_12         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_12

#define AO_CAN_FILTER_IDE_2_12          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_12

#define AO_CAN_FILTER_MASK_2_12         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_12

#define AO_CAN_FILTER_SID_2_12          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_13

#define AO_CAN_FILTER_EID_2_13          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_13

#define AO_CAN_FILTER_ENABLE_2_13       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_13

#define AO_CAN_FILTER_FIFO_2_13         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_13

#define AO_CAN_FILTER_IDE_2_13          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_13

#define AO_CAN_FILTER_MASK_2_13         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_13

#define AO_CAN_FILTER_SID_2_13          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_14

#define AO_CAN_FILTER_EID_2_14          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_14

#define AO_CAN_FILTER_ENABLE_2_14       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_14

#define AO_CAN_FILTER_FIFO_2_14         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_14

#define AO_CAN_FILTER_IDE_2_14          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_14

#define AO_CAN_FILTER_MASK_2_14         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_14

#define AO_CAN_FILTER_SID_2_14          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_15

#define AO_CAN_FILTER_EID_2_15          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_15

#define AO_CAN_FILTER_ENABLE_2_15       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_15

#define AO_CAN_FILTER_FIFO_2_15         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_15

#define AO_CAN_FILTER_IDE_2_15          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_15

#define AO_CAN_FILTER_MASK_2_15         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_15

#define AO_CAN_FILTER_SID_2_15          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_16

#define AO_CAN_FILTER_EID_2_16          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_16

#define AO_CAN_FILTER_ENABLE_2_16       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_16

#define AO_CAN_FILTER_FIFO_2_16         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_16

#define AO_CAN_FILTER_IDE_2_16          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_16

#define AO_CAN_FILTER_MASK_2_16         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_16

#define AO_CAN_FILTER_SID_2_16          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_17

#define AO_CAN_FILTER_EID_2_17          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_17

#define AO_CAN_FILTER_ENABLE_2_17       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_17

#define AO_CAN_FILTER_FIFO_2_17         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_17

#define AO_CAN_FILTER_IDE_2_17          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_17

#define AO_CAN_FILTER_MASK_2_17         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_17

#define AO_CAN_FILTER_SID_2_17          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_18

#define AO_CAN_FILTER_EID_2_18          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_18

#define AO_CAN_FILTER_ENABLE_2_18       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_18

#define AO_CAN_FILTER_FIFO_2_18         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_18

#define AO_CAN_FILTER_IDE_2_18          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_18

#define AO_CAN_FILTER_MASK_2_18         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_18

#define AO_CAN_FILTER_SID_2_18          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_19

#define AO_CAN_FILTER_EID_2_19          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_19

#define AO_CAN_FILTER_ENABLE_2_19       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_19

#define AO_CAN_FILTER_FIFO_2_19         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_19

#define AO_CAN_FILTER_IDE_2_19          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_19

#define AO_CAN_FILTER_MASK_2_19         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_19

#define AO_CAN_FILTER_SID_2_19          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_20

#define AO_CAN_FILTER_EID_2_20          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_20

#define AO_CAN_FILTER_ENABLE_2_20       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_20

#define AO_CAN_FILTER_FIFO_2_20         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_20

#define AO_CAN_FILTER_IDE_2_20          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_20

#define AO_CAN_FILTER_MASK_2_20         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_20

#define AO_CAN_FILTER_SID_2_20          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_21

#define AO_CAN_FILTER_EID_2_21          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_21

