tinko26/ao/src/ao_sys_xc32_pic32/ao_can_2.h
#define AO_CAN_FILTER_ENABLE_2_21       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_21

#define AO_CAN_FILTER_FIFO_2_21         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_21

#define AO_CAN_FILTER_IDE_2_21          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_21

#define AO_CAN_FILTER_MASK_2_21         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_21

#define AO_CAN_FILTER_SID_2_21          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_22

#define AO_CAN_FILTER_EID_2_22          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_22

#define AO_CAN_FILTER_ENABLE_2_22       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_22

#define AO_CAN_FILTER_FIFO_2_22         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_22

#define AO_CAN_FILTER_IDE_2_22          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_22

#define AO_CAN_FILTER_MASK_2_22         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_22

#define AO_CAN_FILTER_SID_2_22          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_23

#define AO_CAN_FILTER_EID_2_23          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_23

#define AO_CAN_FILTER_ENABLE_2_23       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_23

#define AO_CAN_FILTER_FIFO_2_23         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_23

#define AO_CAN_FILTER_IDE_2_23          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_23

#define AO_CAN_FILTER_MASK_2_23         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_23

#define AO_CAN_FILTER_SID_2_23          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_24

#define AO_CAN_FILTER_EID_2_24          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_24

#define AO_CAN_FILTER_ENABLE_2_24       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_24

#define AO_CAN_FILTER_FIFO_2_24         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_24

#define AO_CAN_FILTER_IDE_2_24          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_24

#define AO_CAN_FILTER_MASK_2_24         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_24

#define AO_CAN_FILTER_SID_2_24          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_25

#define AO_CAN_FILTER_EID_2_25          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_25

#define AO_CAN_FILTER_ENABLE_2_25       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_25

#define AO_CAN_FILTER_FIFO_2_25         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_25

#define AO_CAN_FILTER_IDE_2_25          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_25

#define AO_CAN_FILTER_MASK_2_25         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_25

#define AO_CAN_FILTER_SID_2_25          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_26

#define AO_CAN_FILTER_EID_2_26          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_26

#define AO_CAN_FILTER_ENABLE_2_26       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_26

#define AO_CAN_FILTER_FIFO_2_26         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_26

#define AO_CAN_FILTER_IDE_2_26          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_26

#define AO_CAN_FILTER_MASK_2_26         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_26

#define AO_CAN_FILTER_SID_2_26          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_27

#define AO_CAN_FILTER_EID_2_27          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_27

#define AO_CAN_FILTER_ENABLE_2_27       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_27

#define AO_CAN_FILTER_FIFO_2_27         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_27

#define AO_CAN_FILTER_IDE_2_27          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_27

#define AO_CAN_FILTER_MASK_2_27         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_27

#define AO_CAN_FILTER_SID_2_27          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_28

#define AO_CAN_FILTER_EID_2_28          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_28

#define AO_CAN_FILTER_ENABLE_2_28       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_28

#define AO_CAN_FILTER_FIFO_2_28         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_28

#define AO_CAN_FILTER_IDE_2_28          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_28

#define AO_CAN_FILTER_MASK_2_28         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_28

#define AO_CAN_FILTER_SID_2_28          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_29

#define AO_CAN_FILTER_EID_2_29          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_29

#define AO_CAN_FILTER_ENABLE_2_29       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_29

#define AO_CAN_FILTER_FIFO_2_29         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_29

#define AO_CAN_FILTER_IDE_2_29          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_29

#define AO_CAN_FILTER_MASK_2_29         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_29

#define AO_CAN_FILTER_SID_2_29          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_30

#define AO_CAN_FILTER_EID_2_30          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_30

#define AO_CAN_FILTER_ENABLE_2_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_30

#define AO_CAN_FILTER_FIFO_2_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_2_30

#define AO_CAN_FILTER_IDE_2_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_30

#define AO_CAN_FILTER_MASK_2_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_30

#define AO_CAN_FILTER_SID_2_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_2_31

#define AO_CAN_FILTER_EID_2_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_2_31

#define AO_CAN_FILTER_ENABLE_2_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_2_31

#define AO_CAN_FILTER_FIFO_2_31         (0)

#endif

