tinko26/ao/src/ao_sys_xc32_pic32/ao_can_2.h
#ifndef AO_CAN_FILTER_IDE_2_31

#define AO_CAN_FILTER_IDE_2_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_2_31

#define AO_CAN_FILTER_MASK_2_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_2_31

#define AO_CAN_FILTER_SID_2_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_0

#define AO_CAN_FILTER_MASK_EID_2_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_0

#define AO_CAN_FILTER_MASK_IDE_2_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_0

#define AO_CAN_FILTER_MASK_SID_2_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_1

#define AO_CAN_FILTER_MASK_EID_2_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_1

#define AO_CAN_FILTER_MASK_IDE_2_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_1

#define AO_CAN_FILTER_MASK_SID_2_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_2

#define AO_CAN_FILTER_MASK_EID_2_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_2

#define AO_CAN_FILTER_MASK_IDE_2_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_2

#define AO_CAN_FILTER_MASK_SID_2_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_2_3

#define AO_CAN_FILTER_MASK_EID_2_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_2_3

#define AO_CAN_FILTER_MASK_IDE_2_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_2_3

#define AO_CAN_FILTER_MASK_SID_2_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_2

#define AO_CAN_INVALID_2                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_2

#define AO_CAN_MODE_2                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_2

#define AO_CAN_OVERFLOW_2               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_2

#define AO_CAN_SENT_2                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_2

#define AO_CAN_SYSTEM_2                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_2

#define AO_CAN_TIMER_2                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_2

#define AO_CAN_UNDERFLOW_2              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_2

#define AO_CAN_WAKE_UP_2                (false)

#endif

// ----------------------------------------------------------------------------

// Constants.

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_MAX_2

#define AO_CAN_BAUD_MAX_2               AO_CAN_BAUD_MAX(AO_SYS_CLOCK_CAN2)

#endif

#ifndef AO_CAN_BAUD_MIN_2

#define AO_CAN_BAUD_MIN_2               AO_CAN_BAUD_MIN(AO_SYS_CLOCK_CAN2)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_2

#define AO_CAN_BUFFERS_2                                                    \
(                                                                           \
        (AO_CAN_BUFFERS_2_0)  +                                             \
        (AO_CAN_BUFFERS_2_1)  +                                             \
        (AO_CAN_BUFFERS_2_2)  +                                             \
        (AO_CAN_BUFFERS_2_3)  +                                             \
        (AO_CAN_BUFFERS_2_4)  +                                             \
        (AO_CAN_BUFFERS_2_5)  +                                             \
        (AO_CAN_BUFFERS_2_6)  +                                             \
        (AO_CAN_BUFFERS_2_7)  +                                             \
        (AO_CAN_BUFFERS_2_8)  +                                             \
        (AO_CAN_BUFFERS_2_9)  +                                             \
        (AO_CAN_BUFFERS_2_10) +                                             \
        (AO_CAN_BUFFERS_2_11) +                                             \
        (AO_CAN_BUFFERS_2_12) +                                             \
        (AO_CAN_BUFFERS_2_13) +                                             \
        (AO_CAN_BUFFERS_2_14) +                                             \
        (AO_CAN_BUFFERS_2_15) +                                             \
        (AO_CAN_BUFFERS_2_16) +                                             \
        (AO_CAN_BUFFERS_2_17) +                                             \
        (AO_CAN_BUFFERS_2_18) +                                             \
        (AO_CAN_BUFFERS_2_19) +                                             \
        (AO_CAN_BUFFERS_2_20) +                                             \
        (AO_CAN_BUFFERS_2_21) +                                             \
        (AO_CAN_BUFFERS_2_22) +                                             \
        (AO_CAN_BUFFERS_2_23) +                                             \
        (AO_CAN_BUFFERS_2_24) +                                             \
        (AO_CAN_BUFFERS_2_25) +                                             \
        (AO_CAN_BUFFERS_2_26) +                                             \
        (AO_CAN_BUFFERS_2_27) +                                             \
        (AO_CAN_BUFFERS_2_28) +                                             \
        (AO_CAN_BUFFERS_2_29) +                                             \
        (AO_CAN_BUFFERS_2_30) +                                             \
        (AO_CAN_BUFFERS_2_31)                                               \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_2

#define AO_CAN_FIFOS_2                                                      \
(                                                                           \
        (AO_CAN_FIFOS_RX_2) +                                               \
        (AO_CAN_FIFOS_TX_2)                                                 \
)

#endif

// ----------------------------------------------------------------------------

