tinko26/ao/src/ao_sys_xc32_pic32/ao_can_2.h
#ifndef AO_CAN_RX_2

#define AO_CAN_RX_2                                                         \
(                                                                           \
        (AO_CAN_FIFOS_RX_2) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_2

#define AO_CAN_TX_2                                                         \
(                                                                           \
        (AO_CAN_FIFOS_TX_2) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_can_reg_2

#define ao_can_reg_2()                                                      \
(                                                                           \
        (ao_can_reg_t *)                                                    \
        (                                                                   \
            _CAN2_BASE_ADDRESS                                              \
        )                                                                   \
)

#endif

// ----------------------------------------------------------------------------

void    ao_can_listen_all_2();

void    ao_can_listen_only_2();

void    ao_can_loopback_2();

void    ao_can_normal_2();

// ----------------------------------------------------------------------------

void    ao_can_start_2();

void    ao_can_stop_2();

// ----------------------------------------------------------------------------

void    ao_can_bus_2(                   ao_can_bus_t const * x);

void    ao_can_invalid_2();

void    ao_can_mode_2();

void    ao_can_overflow_2(              uint32_t fifos);

void    ao_can_sent_2(                  uint32_t fifos);

void    ao_can_system_2(                ao_can_system_t x);

void    ao_can_timer_2();

void    ao_can_underflow_2(             uint32_t fifos);

void    ao_can_wake_up_2();

// ----------------------------------------------------------------------------

extern  ao_send_obj_t                   ao_can_in_2     [AO_CAN_FIFOS_RX_2];

extern  ao_recv_obj_t                   ao_can_out_2    [AO_CAN_FIFOS_TX_2];

// ----------------------------------------------------------------------------

extern  ao_task_t                       ao_can_task_2;

// ----------------------------------------------------------------------------
